class Forms {
  String? formId;
  List<String> illnessList = [
    'السكري',
    'ضغط الدم',
    'القلب',
    'الربو',
    'الصرع',
    'السرطان',
    'الكلى',
    'الكبد',
    'الرئة',
    'فقر الدم',
  ];
  List<String> medicineList = [
    'الإنسولين',
    'الميتفورمين',
    'الأسبرين',
    'باراسيتامول',
    'أدوية الصرع',
    'مضادات حيوية',
    'أملوديبين',
    'أتينولول',
    'الكورتيزون',
  ];
  List<String> allergiesList = [
    'حساسية الأدوية',
    'حساسية الأطعمة',
    'حساسية الحيوانات',
    'حساسية أخرى',
  ];
  List<String> addictionsList = [
    'التدخين',
    'الكحول',
    'الكافين',
    'المخدرات',
    'الأدوية المهدئة',
    'المسكنات القوية',
  ];
  List<String> geneticdiseasesList = [
    'السكري',
    'ضغط الدم',
    'القلب',
    'الربو',
    'الصرع',
    'السرطان',
    'الكلى',
    'الكبد',
    'الرئة',
    'فقر الدم',
  ];
  List<String> previousSurgeriesList = [
    'استئصال الزائدة الدودية',
    'استئصال المرارة',
    'عمليات الفتق',
    'العمليات القيصرية',
    'جراحات العظام',
    'جراحات القلب',
    'جراحات العيون',
    'جراحات الأنف والأذن والحنجرة',
    'استئصال اللوزتين',
    'عمليات المسالك البولية',
  ];
  List<String> selectedIllnesses = []; // لتخزين الأمراض المختارة
  List<String> selectedMedicines = []; // لتخزين الأدوية المختارة
  List<String> selectedAllergies = []; // لتخزين الحساسيات المختارة
  List<String> selectedAddictions = []; // لتخزين الادمان المختار
  List<String> selectedGeneticDiseases = []; // لتخزين المرض الورائي المختارة
  List<String> selectedPreviousSurgeries = []; // لتخزين الحساسيات المختارة
}
